Autodesk.Revit.DB.IPDFParametersProviderProxy.ProvideParameter(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Transform)
Provide Tag and Properties for a PDF container's Marked Content of a Revit view region.
document:
The document which PDF exporter is exporting. And it should be the host document if there are links.
viewId:
The view id which PDF exporter is processing.
viewRegionIndex:
The index of the view region which PDF exporter is processing, starting from -1.
viewportId:
The viewport of the view region.
viewRegionTransform:
The "model (in inch) to PDF page (in PDF page unit)" transform of the view region.
Returns:
The parameter to the PDF container of the Revit element.
Since:
2022